# Pandas

In [9]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'age' :     [ 10, 22, 13, 21, 12, 11, 17],'section' : [ 'A', 'B', 'C', 'B', 'B', 'A', 'A'],'city' :    [ 'Gurgaon', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai'],'gender' :  [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
 'favourite_color' : [ 'red', np.NAN, 'yellow', np.NAN, 'black', 'green', 'red']
 })

## Data
|index|age|section|city|gender|favourite_color|
|-|-|-|-|-|-|
|0|10|A|Gurgaon|M|red|
|1|22|B|Delhi|F|NaN|
|2|13|C|Mumbai|F|yellow|
|3|21|B|Delhi|M|NaN|
|4|12|B|Mumbai|M|black|
|5|11|A|Delhi|M|green|
|6|17|A|Mumbai|F|red|

### 1. Find the rows where the value of `age` is greater than equal to 15:

In [2]:
df[df.age >= 15]

   age section    city gender favourite_color
1   22       B   Delhi      F             NaN
3   21       B   Delhi      M             NaN
6   17       A  Mumbai      F             red

### 2. Find all the rows where the `age` is greater than or equal to 12 and the `gender` is also male

In [3]:
df[(df.age >= 12) & (df.gender == "M")]

   age section    city gender favourite_color
3   21       B   Delhi      M             NaN
4   12       B  Mumbai      M           black

### 3. finding selective range of rows using loc, essentially slicing, 1 - 4 rows

In [4]:
df.loc[1:4]

   age section    city gender favourite_color
1   22       B   Delhi      F             NaN
2   13       C  Mumbai      F          yellow
3   21       B   Delhi      M             NaN
4   12       B  Mumbai      M           black

### 4. Find the `city` and `gender` where the `age` is greater than equal to 12

In [5]:
df.loc[(df.age >= 12),["city", "gender"]]

     city gender
1   Delhi      F
2  Mumbai      F
3   Delhi      M
4  Mumbai      M
6  Mumbai      F

### 5. Update the `gender` to `M` if the `age` is greater than equal to 12

In [6]:
df.loc[(df.age>=12), ["gender"]] = "M"
df

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      M             NaN
2   13       C   Mumbai      M          yellow
3   21       B    Delhi      M             NaN
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       A   Mumbai      M             red

### 6. Update `section` to `S` and `city` to Pune if `age` is greater than 20

In [8]:
df.loc[(df.age > 20),["section","city"]] = ["S", "Pune"]
df

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       S     Pune      F             NaN
2   13       C   Mumbai      F          yellow
3   21       S     Pune      M             NaN
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       A   Mumbai      F             red

### 7. Print the 3 topmost lines

In [11]:
df.head(3)

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F             NaN
2   13       C   Mumbai      F          yellow

### 8. Print the 3 bottom most lines

In [12]:
df.tail(3)

   age section    city gender favourite_color
4   12       B  Mumbai      M           black
5   11       A   Delhi      M           green
6   17       A  Mumbai      F             red

### 9. Print all the column names

In [13]:
df.columns

Index(['age', 'section', 'city', 'gender', 'favourite_color'], dtype='object')

## Lab

### 1. Create data dictionary for below data, then convert it into a data frame.
   1. Print all coulmns where the `Name` of students begin with the letter 'A' and `Percentage` is higher than 85 using `index` attribute.
   2. Print `Age` column using `loc` function. Print the average age.
   3. Print `0th` and `2nd` rows using `iloc` function.
   4. Update the `Percentage` column between `0` and `1`
   
   |Name|Age|Stream|Percentage|
   |-|-|-|-|
   |Rima|21|Math|58|
   |Alok|19|Commerce|92|
   |Anandita|20|Arts|85|
   |Priyanka|18|Biology|30|

In [22]:
# Given data in the table 
data = {
    "Name": ["Rima", "Alok", "Anandita", "Priyanka"],
    "Age": [21, 19, 20, 18],
    "Stream": ["Math", "Commerce", "Arts", "Biology"],
    "Percentage": [58, 92, 85, 30]
}

# Creating a DataFrame from the data
df = pd.DataFrame(data)

In [21]:
# df[(df.Name.str.startswith("A")) & (df.Percentage > 85)] 1
# df.loc[:, ["Age"]]
# df.loc[:, ["Age"]].mean 2
# df.iloc[[0,2]] 3
# df.loc[:, ["Percentage"]] /= 100 4
df

       Name  Age    Stream  Percentage
0      Rima   21      Math        0.58
1      Alok   19  Commerce        0.92
2  Anandita   20      Arts        0.85
3  Priyanka   18   Biology        0.30

### 2. For the given data set display number of empty records, null values for each column. Identify columns that require data cleaning and clean them as per your analysis.

|Name|Age|Stream|Percentage|
   |-|-|-|-|
   |Rima|21|Math|58|
   |Alok||Commerce|92|
   |Anandita|20|Arts||
   |Priyanka|18|Biology|30|

In [36]:
data = {
    'Name': ['Rima', 'Alok', 'Anandita', 'Priyanka'],
    'Age': [21,"NA", 20, 18],  # Assuming 'NA' for Alok's age
    'Stream': ['Math', 'Commerce', 'Arts', 'Biology'],
    'Percentage': [58, 92,"NA", 30]  # Assuming 'NA' for Anandita's percentage
}

df = pd.DataFrame(data)

df

SyntaxError: invalid syntax (2737191522.py, line 3)

In [37]:
df["Percentage"].fillna("Unknown", inplace=True)
df["Age"].fillna("Unknown", inplace=True)
df

0

       Name Age    Stream Percentage
0      Rima  21      Math         58
1      Alok  NA  Commerce         92
2  Anandita  20      Arts         NA
3  Priyanka  18   Biology         30